       IDENTIFICATION DIVISION.
       PROGRAM-ID.  TANGGAP.
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SOURCE-COMPUTER.  IBM.
       OBJECT-COMPUTER.  IBM.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT VON  ASSIGN TO 'RENEE'.
       DATA DIVISION.
       FILE SECTION.
       FD  VON
           LABEL RECORD IS STANDARD
           DATA RECORD IS OUTREC.
       01  OUTREC.
           05  D-SNO PIC 9(5).
           05  D-SNA PIC X(25).
           05  D-COUR  PIC X(5).
           05  D-YEAR  PIC 9.
           05  D-SECT  PIC 9.
           05  D-GENDER PIC X.
       WORKING-STORAGE SECTION.
       01  EOFSW PIC 9 VALUE 0.
       01  SNO PIC 9(5) VALUE 0.
       01  SNA  PIC X(25)  VALUE SPACES.
       01  COURSE PIC X(5) VALUE SPACES.
       01  YEAR PIC 9 VALUE 0.
       01  SEKTION PIC 9 VALUE 0.
       01  GE PIC X VALUE SPACES.
       01  ENO PIC X  VALUE 'Y'.
       SCREEN SECTION.
       01  SCRE.
               02  BLANK SCREEN.
       PROCEDURE DIVISION.
       MAIN-RTN.
           OPEN OUTPUT VON.
           PERFORM AKSEPT-RTN THRU  AKSEPT-RTN-END UNTIL EOFSW = 1.
           CLOSE VON.  
           STOP RUN.
       AKSEPT-RTN.
           DISPLAY SCRE.
           DISPLAY 'STUDENT INFORMATION:' LINE 7 COLUMN 20.
           DISPLAY 'STUDENT NUMBER:' LINE 9 COLUMN 25.
           ACCEPT SNO LINE 9 COLUMN 40.
           MOVE SNO TO D-SNO.
           DISPLAY 'STUDENT NAME;' LINE 10 COLUMN 25.
           ACCEPT SNA LINE 10 COLUMN 40.
	       MOVE SNA TO D-SNA.
           DISPLAY 'COURSE' LINE 11 COLUMN 25.
           ACCEPT COURSE LINE 11 COLUMN 40.
	       MOVE COURSE TO D-COUR.
           DISPLAY 'YEAR' LINE 12 COLUMN 25.
           ACCEPT YEAR LINE 12 COLUMN 40.
	       MOVE YEAR TO D-YEAR.
           DISPLAY 'SECTION' LINE 13 COLUMN 25.
           ACCEPT SEKTION LINE 13 COLUMN 40.
	       MOVE SEKTION TO D-SECT.
  	       PERFORM GENDER-RTN
           UNTIL GE = 'M' OR GE = 'm'
           OR GE = 'F' OR GE = 'f'.
           MOVE GE TO D-GENDER
           DISPLAY 'GENDER NAME' LINE 15 COLUMN 25
           WRITE OUTREC.
	       MOVE SPACES TO GE
           DISPLAY 'INPUT ANOTHER RECORD:' LINE 16 COLUMN 25.
           ACCEPT ENO LINE 16 COLUMN 50.
           IF ENO = 'N' MOVE 1 TO EOFSW.
       AKSEPT-RTN-END.
       GENDER-RTN.
	       DISPLAY 'GENDER:' LINE 14 COLUMN 25.
           ACCEPT GE LINE 14 COLUMN 40.
           IF GE = 'M' OR GE = 'm' DISPLAY 'MALE' 
           LINE   15 COLUMN 40.
	       IF GE = 'F' OR GE = 'f' DISPLAY 'FEMALE'
           LINE   15 COLUMN 40.
 
