       IDENTIFICATION DIVISION.
       PROGRAM-ID. CobolBank.
      *AUTHOR. Mondejar
      *INSTALLATION. PUP-MANILA.
      *DATE-WRITTEN. 01/29/2024.
      *DATE-COMPILED. 01/29/2024.
      *SECURITY. BSIT 2-2N ONLY.
      *REMARKS. Assignment.
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SOURCE-COMPUTER. Gigavyte-Laptop.
       OBJECT-COMPUTER. Gigavyte-Laptop.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT INFILE ASSIGN TO "china.txt".
           SELECT OUTFILE ASSIGN TO "jeiren".
       DATA DIVISION.
       FILE SECTION.
       FD  INFILE
           LABEL RECORD IS STANDARD 
           RECORD CONTAINS 45 CHARACTERS
           DATA RECORD IS INREC.
       01  INREC.
           02 ANO PIC X(10).
           02 ANA PIC X(25).
           02 TC PIC X.
           02 AMT PIC 9(7)V99.
       FD  OUTFILE
           LABEL RECORDS ARE OMITTED
           DATA RECORD IS OUTREC.
       01  OUTREC.
           02 FILLER PIC X(80).
       WORKING-STORAGE SECTION.
       01  D PIC 9(7)V99 VALUE ZERO.
       01  W PIC 9(7)V99 VALUE ZERO.
       01  SVANO PIC X(10) VALUE SPACES.
       01  SVANA PIC X(25) VALUE SPACES.
       01  BAL PIC 9(9)V99 VALUE ZERO.
       01  TNR PIC 9 VALUE ZERO.
       01  TBAL PIC 9(10)V99 VALUE ZERO.
       01  EOFSW PIC 9 VALUE ZERO.
       01  HEAD-1.
           02 FILLER PIC X(32) VALUE SPACES.
           02 FILLER PIC X(16) VALUE "CHINA TRUST BANK".
           02 FILLER PIC X(32) VALUE SPACES.
       01  HEAD-2.
           02 FILLER PIC X(33) VALUE SPACES.
           02 FILLER PIC X(13) VALUE "MAKATI AVENUE".
           02 FILLER PIC X(34) VALUE SPACES.
       01  HEAD-3.
           02 FILLER PIC X(34) VALUE SPACES.
           02 FILLER PIC X(11) VALUE "MAKATI CITY".
           02 FILLER PIC X(35) VALUE SPACES.
       01  SUB-1.
           02 FILLER PIC X(32) VALUE SPACES.
           02 FILLER PIC X(16) VALUE "ACCOUNTS' REPORT".
           02 FILLER PIC X(32) VALUE SPACES.
       01  SUB-2.
           02 FILLER PIC X(11) VALUE SPACES.
           02 FILLER PIC X(7) VALUE "ACCOUNT".
           02 FILLER PIC X(8) VALUE SPACES.
           02 FILLER PIC X(7) VALUE "ACCOUNT".
           02 FILLER PIC X(23) VALUE SPACES.
           02 FILLER PIC X(7) VALUE "BALANCE".
           02 FILLER PIC X(17) VALUE SPACES.
       01  SUB-3.
           02 FILLER PIC X(11) VALUE SPACES.
           02 FILLER PIC X(6) VALUE "NUMBER".
           02 FILLER PIC X(9) VALUE SPACES.
           02 FILLER PIC X(4) VALUE "NAME".
           02 FILLER PIC X(50) VALUE SPACES.
       01  DETAILS.
           02 FILLER PIC X(11) VALUE SPACES.
           02 P-SVANO PIC X(10).
           02 FILLER PIC X(5) VALUE SPACES.
           02 P-SVANA PIC X(25).
           02 FILLER PIC X(5) VALUE SPACES.
           02 P-BAL PIC ZZZ,ZZZ,ZZ9.99.
           02 FILLER PIC X(11) VALUE SPACES.
       01  TOTAL-1.
           02 FILLER PIC X(11) VALUE SPACES.
           02 FILLER PIC X(13) VALUE "TOTAL NO. OF ".
           02 FILLER PIC X(17) VALUE "RECORDS PRINTED: ".
           02 P-TNR PIC 9.
           02 FILLER PIC X(38) VALUE SPACES.
       01  TOTAL-2.
           02 FILLER PIC X(11) VALUE SPACES.
           02 FILLER PIC X(18) VALUE "TOTAL ACCUMULATED ".
           02 FILLER PIC X(11) VALUE "BALANCE: P ".
           02 P-TBAL PIC Z,ZZZ,ZZZ,ZZ9.99.
           02 FILLER PIC X(25) VALUE SPACES.
       SCREEN SECTION.
       01  SCRE.
           02 BLANK SCREEN.
       PROCEDURE DIVISION.
       MAIN-RTN.
           PERFORM INIT-RTN THRU INIT-RTN-END.
           PERFORM PROCESS-RTN UNTIL EOFSW = 1.
           PERFORM FINISH-RTN.
           STOP RUN.
       INIT-RTN.
           OPEN INPUT INFILE, OUTPUT OUTFILE.
           READ INFILE AT END PERFORM END-RTN
           GO TO INIT-RTN-END.
           MOVE ANO TO SVANO.
           MOVE ANA TO SVANA.
           PERFORM HEADING-RTN.
       INIT-RTN-END.
       END-RTN.
           MOVE 1 TO EOFSW.
           DISPLAY "EMPTY FILE" LINE 3 COLUMN 20.
       HEADING-RTN.
           WRITE OUTREC FROM HEAD-1 AFTER PAGE.
           WRITE OUTREC FROM HEAD-2 AFTER 1.
           WRITE OUTREC FROM HEAD-3 AFTER 1.
           WRITE OUTREC FROM SUB-1 AFTER 3.
           WRITE OUTREC FROM SUB-2 AFTER 2.
           WRITE OUTREC FROM SUB-3 AFTER 1.
       PROCESS-RTN.
           DISPLAY SCRE.
           IF SVANO NOT = ANO AND SVANA NOT = ANA
           PERFORM BREAK-RTN
           ELSE NEXT SENTENCE.
           IF TC = 'D' OR 'd' ADD AMT TO D.
           IF TC = 'W' OR 'w' ADD AMT TO W
           ELSE NEXT SENTENCE.
           READ INFILE AT END MOVE 1 TO EOFSW 
           PERFORM BREAK-RTN.
       BREAK-RTN.
           COMPUTE BAL = D - W.
           MOVE SVANO TO P-SVANO.
           MOVE SVANA TO P-SVANA.
           MOVE BAL TO P-BAL.
           WRITE OUTREC FROM DETAILS AFTER 1.
           ADD BAL TO TBAL.
           ADD 1 TO TNR.
           MOVE 0 TO BAL, D, W.
           MOVE ANO TO SVANO.
           MOVE ANA TO SVANA.
       FINISH-RTN.
           MOVE TNR TO P-TNR.
           MOVE TBAL TO P-TBAL.
           WRITE OUTREC FROM TOTAL-1 AFTER 3.
           WRITE OUTREC FROM TOTAL-2 AFTER 1.
           CLOSE INFILE, OUTFILE.
           DISPLAY "Tapos na" LINE 6 COLUMN 20.