       IDENTIFICATION DIVISION.
       PROGRAM-ID.  ARRAYS.
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SOURCE-COMPUTER.  IBM.
       OBJECT-COMPUTER.  IBM.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT STUDENT  ASSIGN TO 'ARRAY.TXT'.
           SELECT OUTFILE  ASSIGN TO 'ArrOutput.txt'.
       
       DATA	DIVISION.
       FILE	SECTION.
       FD  STUDENT
           LABEL RECORD IS STANDARD
           DATA RECORD IS INREC.
       01 INREC.
           02 SNO PIC 9(5).
           02 SNA  PIC X(25).
           02 QUIZ OCCURS 5 TIMES PIC 99. 
       FD  OUTFILE
           LABEL RECORD IS STANDARD
           DATA RECORD IS OUTREC.
       01  OUTREC.
           02 FILLER PIC X(80). 
       WORKING-STORAGE SECTION.
       01  EOFSW PIC 9 VALUE 0.
       01  TQ PIC 9999 VALUE 0.
       01  prt-AVE PIC 99.99 VALUE ZEROS.
       01  I PIC 9 VALUE 0.
       01  HEADER-1.
           02 FILLER PIC X(29) VALUE SPACES.
           02 FILLER PIC X(22) VALUE "POLYTECHNIC UNIVERSITY".
           02 FILLER PIC X(29) VALUE SPACES.

       01  HEADER-2.
           02 FILLER PIC X(31) VALUE SPACES.
           02 FILLER PIC X(18) VALUE "OF THE PHILIPPINES".
           02 FILLER PIC X(31) VALUE SPACES.

       01  HEADER-3.
           02 FILLER PIC X(30) VALUE SPACES.
           02 FILLER PIC X(19) VALUE "COLLEGE OF COMPUTER".
           02 FILLER PIC X(31) VALUE SPACES.

       01  HEADER-4.
           02 FILLER PIC X(28) VALUE SPACES.
           02 FILLER PIC X(24) VALUE "AND INFORMATION SCIENCES".
           02 FILLER PIC X(28) VALUE SPACES.   
       
       01  COL-1.
           02 FILLER PIC X(7) VALUE SPACES.
           02 FILLER PIC X(7) VALUE "STUDENT".
           02 FILLER PIC X(4) VALUE SPACES.
           02 FILLER PIC X(7) VALUE "STUDENT".
           02 FILLER PIC X(4) VALUE SPACES.
           02 FILLER PIC X(4) VALUE "QUIZ".
           02 FILLER PIC X(4) VALUE SPACES.
           02 FILLER PIC X(4) VALUE "QUIZ".
           02 FILLER PIC X(4) VALUE SPACES.
           02 FILLER PIC X(4) VALUE "QUIZ".
           02 FILLER PIC X(4) VALUE SPACES.
           02 FILLER PIC X(4) VALUE "QUIZ".
           02 FILLER PIC X(4) VALUE SPACES.
           02 FILLER PIC X(4) VALUE "QUIZ".
           02 FILLER PIC X(4) VALUE SPACES.
           02 FILLER PIC X(7) VALUE "AVERAGE".
           02 FILLER PIC X(4) VALUE SPACES.

       01  COL-2.
           02 FILLER PIC X(8) VALUE SPACES.
           02 FILLER PIC X(6) VALUE "NUMBER".
           02 FILLER PIC X(4) VALUE SPACES.
           02 FILLER PIC X(4) VALUE "NAME".
           02 FILLER PIC X(7) VALUE SPACES.
           02 FILLER PIC X(1) VALUE "1".
           02 FILLER PIC X(6) VALUE SPACES.
           02 FILLER PIC X(1) VALUE "2".
           02 FILLER PIC X(6) VALUE SPACES.
           02 FILLER PIC X(1) VALUE "3".
           02 FILLER PIC X(7) VALUE SPACES.
           02 FILLER PIC X(1) VALUE "4".
           02 FILLER PIC X(7) VALUE SPACES.
           02 FILLER PIC X(1) VALUE "5".
           02 FILLER PIC X(20) VALUE SPACES.

       01  DETALYE.
           02 FILLER PIC X(2) VALUE SPACES.
           02 P-SNO PIC 9(5).
           02 FILLER PIC X(2) VALUE SPACES.
           02 P-SNA   PIC X(25).
           02 FILLER PIC X(2) VALUE SPACES.
           02 PRT-Q  OCCURS 5 TIMES .
             03    PRT-QUIZ PIC 99 .
             03    FILLER PIC X(5).
           02 FILLER PIC X(2) VALUE SPACES.
           02 AVE PIC 99.99.

       SCREEN SECTION.
       01 SCRE.
           02 BLANK SCREEN.

       PROCEDURE DIVISION.
       MAIN-RTN.
           PERFORM INIT-RTN.
           PERFORM CCMIT-RTN UNTIL EOFSW = 1.
           PERFORM FINISH-RTN.
           STOP RUN.
       INIT-RTN.
           OPEN INPUT STUDENT, OUTPUT OUTFILE.
           WRITE OUTREC FROM HEADER-1 AFTER PAGE.
           WRITE OUTREC FROM HEADER-2 AFTER ADVANCING 1 LINE.
           WRITE OUTREC FROM HEADER-3 AFTER ADVANCING 1 LINE.
           WRITE OUTREC FROM HEADER-4 AFTER ADVANCING 1 LINE.
           WRITE OUTREC FROM COL-1 AFTER 2.
           WRITE OUTREC FROM COL-2 AFTER 1.
       CCMIT-RTN.
           DISPLAY SCRE
           READ STUDENT AT END  MOVE 1 TO EOFSW PERFORM CCMIT-RTN-END.
                    MOVE SNO TO P-SNO.
                    MOVE SNA TO P-SNA.
           PERFORM BSIT-RTN VARYING I FROM 1 BY 1 UNTIL I > 5.
           COMPUTE AVE = TQ / 5.
           WRITE OUTREC FROM DETALYE AFTER 1 LINE.
       CCMIT-RTN-END.
       BSIT-RTN.
           MOVE QUIZ (I) TO PRT-QUIZ (I).
           ADD QUIZ (I) TO TQ.
       FINISH-RTN.
           CLOSE STUDENT, OUTFILE.
           DISPLAY "INPUT ""TYPE ARROUTPUT""" LINE 10 COLUMN 20.