       IDENTIFICATION DIVISION.
       PROGRAM-ID. friends.
      *AUTHOR. JEI.
      *INSTALLATION. TAYTAY.
      *DATE-WRITTEN. 01-26-2024.
      *DATE-COMPILED. 01-26-2024.
      *SECURITY. US ONLY.
      *REMARKS first cobol.

       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SOURCE-COMPUTER. GIGABYTE.
       OBJECT-COMPUTER. GIGABYTE.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT INFILE ASSIGN TO "QUIZ.txt".
           SELECT OUTFILE ASSIGN TO "results".
       DATA DIVISION.
       FILE SECTION.
       FD  INFILE
           LABEL RECORD IS STANDARD
           DATA RECORD IS INREC.
       01  INREC.
           02 SNO PIC 9(5).
           02 SNA PIC X(25).
           02 QUIZ OCCURS 5 TIMES PIC 99.
       FD  OUTFILE
           LABEL RECORD IS OMITTED
           DATA RECORD IS OUTREC.
       01  OUTREC.
           02 FILLER PIC X(80).
       WORKING-STORAGE SECTION.
       01  I PIC 9 VALUE ZERO.
       01  EOFSW PIC 9 VALUE ZERO.
       01  TQ PIC 9 VALUE ZERO.
       01  PRT-AVG PIC 99.99 VALUE ZERO.
       01  HEAD-1.
           02 FILLER PIC X(38) VALUE SPACES.
           02 FILLER PIC X(3) VALUE "PUP". 
           02 FILLER PIC X(39) VALUE SPACES.
       01  HEAD-2.
           02 FILLER PIC X(38) VALUE SPACES.
           02 FILLER PIC X(4) VALUE "CCIS".
           02 FILLER PIC X(38) VALUE SPACES.
       01  SUB-1.
           02 FILLER PIC X(7) VALUE SPACES.
           02 FILLER PIC X(7) VALUE "STUDENT".
           02 FILLER PIC X(4) VALUE SPACES.
           02 FILLER PIC X(7) VALUE "STUDENT".
           02 FILLER PIC X(4) VALUE SPACES.
           02 FILLER PIC X(4) VALUE "QUIZ".
           02 FILLER PIC X(4) VALUE SPACES.
           02 FILLER PIC X(4) VALUE "QUIZ".
           02 FILLER PIC X(4) VALUE SPACES.
           02 FILLER PIC X(4) VALUE "QUIZ".
           02 FILLER PIC X(4) VALUE SPACES.
           02 FILLER PIC X(4) VALUE "QUIZ".
           02 FILLER PIC X(4) VALUE SPACES.
           02 FILLER PIC X(4) VALUE "QUIZ".
           02 FILLER PIC X(4) VALUE SPACES.
           02 FILLER PIC X(7) VALUE "AVERAGE".
           02 FILLER PIC X(4) VALUE SPACES.
       01  SUB-2.
           02 FILLER PIC X(8) VALUE SPACES.
           02 FILLER PIC X(6) VALUE "NUMBER".
           02 FILLER PIC X(4) VALUE SPACES.
           02 FILLER PIC X(4) VALUE "NAME".
           02 FILLER PIC X(7) VALUE SPACES.
           02 FILLER PIC X(1) VALUE "1".
           02 FILLER PIC X(6) VALUE SPACES.
           02 FILLER PIC X(1) VALUE "2".
           02 FILLER PIC X(6) VALUE SPACES.
           02 FILLER PIC X(1) VALUE "3".
           02 FILLER PIC X(7) VALUE SPACES.
           02 FILLER PIC X(1) VALUE "4".
           02 FILLER PIC X(7) VALUE SPACES.
           02 FILLER PIC X(1) VALUE "5".
           02 FILLER PIC X(20) VALUE SPACES.
       01  DETALYE.
           02 FILLER PIC X(2) VALUE SPACES.
           02 P-SNO PIC 9(5).
           02 FILLER PIC X(2) VALUE SPACES.
           02 P-SNA   PIC X(25).
           02 FILLER PIC X(2) VALUE SPACES.
           02 PRT-Q  OCCURS 5 TIMES.
             03    PRT-QUIZ PIC 99.
             03    FILLER PIC X(5).
           02 FILLER PIC X(2) VALUE SPACES.
           02 AVE PIC 9(2)V99 VALUE ZERO.
       SCREEN SECTION.
       01  SCRE.
           02 BLANK SCREEN.
       PROCEDURE DIVISION.
       MAIN-RTN.
           PERFORM INIT-RTN.
           PERFORM CCMIT-RTN THRU CCMIT-RTN-END UNTIL EOFSW = 1.
           PERFORM FINISH-RTN.
           STOP RUN.
       INIT-RTN.
           OPEN INPUT INFILE, OUTPUT OUTFILE.
           READ INFILE AT END PERFORM FINISH-RTN
           WRITE OUTREC FROM HEAD-1 AFTER PAGE.
           WRITE OUTREC FROM HEAD-2 AFTER 1.
           WRITE OUTREC FROM SUB-1 AFTER 2.
           WRITE OUTREC FROM SUB-2 AFTER 3.       
       CCMIT-RTN.
           DISPLAY SCRE
           READ INFILE AT END  MOVE 1 TO EOFSW PERFORM CCMIT-RTN-END.
           MOVE SNO TO P-SNO.
           MOVE SNA TO P-SNA.
           PERFORM BSIT-RTN VARYING I FROM 1 BY 1 UNTIL I > 5.
           COMPUTE AVE = TQ / 5.
           WRITE OUTREC FROM DETALYE AFTER 1 LINE.
       CCMIT-RTN-END.
       BSIT-RTN.
           MOVE QUIZ (I) TO PRT-QUIZ (I).
           ADD QUIZ (I) TO TQ.
       FINISH-RTN.
           CLOSE INFILE, OUTFILE.
           DISPLAY "WE love ma'am alet" LINE 10 COLUMN 20.  


       
           