       IDENTIFICATION DIVISION.
       PROGRAM-ID. POPULATION-REPORT.
      *AUTHOR. jei
      *INSTALLATION. PUP-MANILA.
      *DATE-WRITTEN. 02/12/2024.
      *DATE-COMPILED. 02/12/2024.
      *SECURITY. BSIT22N ONLY.
      *REMARKS. PATAPOS PLS. 
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SOURCE-COMPUTER. GIGABYTE.
       OBJECT-COMPUTER. GIGABYTE.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
            SELECT OUTFILE ASSIGN TO "JEI".
       DATA DIVISION.
       FILE SECTION.
       FD   OUTFILE
            LABEL RECORD IS STANDARD
            DATA RECORD IS OUTREC.
       01   OUTREC.

       WORKING-STORAGE SECTION.
       01  PIC 9 VALUE 0.
       01  PIC X VALUE SPACES.
       01  PIC 9(2) VALUE 0.
       01  PIC X(20) VALUE SPACES.
       01  PIC 9(2) VALUE 0.
       01  PIC 9(3) VALUE 0.
       01  PIC 9(3) VALUE 0.
       01  PIC 9(6) VALUE 0.
       01  PIC 9(6) VALUE 0.
       01  PIC 9(4) VALUE 0.
       01  PIC 9(3) VALUE 0.
       01  PIC 9(6) VALUE 999999.
       01  PIC 9(6) VALUE 999999.
       01  PIC ZZZZZ9.
       01  PIC ZZZZZ9.
       01  PIC X(20) VALUE SPACES.
       01  PIC X(20) VALUE SPACES.
       SCREEN SECTION.
       01   SCRE.
            02 BLANK SCREEN.
       PROCEDURE DIVISION.
       MAIN-RTN.
            OPEN OUTPUT OUTFILE.
            PERFORM ACCEPT-RTN THRU ACCEPT-RTN-END UNTIL EOFSW = 1.
            PERFORM FINISH-RTN.
            CLOSE OUTFILE.
            STOP RUN.
       ACCEPT-RTN.
            DISPLAY SCRE.
            MOVE SPACES TO ENO.
            MOVE 0 TO LBC.
            DISPLAY "POLYTECHNIC UNIVERSITY OF THE PHILIPPINES"
            LINE 1 COLUMN 19.
            DISPLAY "STA. MESA, MANILA" LINE 2 COLUMN 31.
            DISPLAY "POPULATION REPORT" LINE 5 COLUMN 31.
            DISPLAY "FIRST SEMESTER" LINE 6 COLUMN 32.
            DISPLAY "2023-2024" LINE 7 COLUMN 35.




            PERFORM ANOTHER-RTN
            UNTIL ENO = 'Y' OR  ENO = 'y' 
            OR  ENO = 'N' OR  ENO = 'n'.
       ANOTHER-RTN.
            DISPLAY "INPUT ANOTHER RECORD (Y/N)?"
            LINE 18 COLUMN 25.
            ACCEPT ENO LINE 18 COLUMN 54.
            IF ENO = 'N' OR 'n' MOVE 1 TO EOFSW.
            IF ENO = 'Y' OR 'y' MOVE 0 TO EOFSW.