       IDENTIFICATION DIVISION.
       PROGRAM-ID. HELLOWORLD.

       PROCEDURE DIVISION.
           DISPLAY "HELLO WORLD".
           DISPLAY "ALEXANDER PORLARES".
           STOP RUN.