       IDENTIFICATION DIVISION.
       PROGRAM-ID. PRACTICE-6.
      *AUTHOR. IT22N REIN FURAGGANAN.
      *INSTALLATION. PUP-MANILA.
      *DATE-WRITTEN. 02/11/24.
      *DATE-COMPILED. 02/11/24.
      *SECURITY. IT22N ONLY.
      *REMARKS. PRACTICE SET 2. 
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SOURCE-COMPUTER. LAPTOP-GUPS4DA8.
       OBJECT-COMPUTER. LAPTOP-GUPS4DA8.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
            SELECT OUTFILE ASSIGN TO "11OUTPUT.TXT".
       DATA DIVISION.
       FILE SECTION.
       FD   OUTFILE
            LABEL RECORD IS OMITTED
            DATA RECORD IS OUTREC.
       01   OUTREC.
            02 FILLER PIC X(80).
       WORKING-STORAGE SECTION.
       01   EOFSW PIC 9 VALUE 0.
       01   ENO PIC X VALUE SPACES.
       01   SNO PIC 9(10) VALUE 0.
       01   SNA PIC X(26) VALUE SPACES.
       01   CRC PIC 9 VALUE 0.
       01   CNA PIC X(25).
       01   YR PIC 9 VALUE 0.
       01   SC PIC 9  VALUE 0.
       01   STY PIC X VALUE SPACES.
       01   STYNA PIC X(10) VALUE SPACES.
       01   TTFEE PIC 9(4)V99 VALUE 0.
       01   SCFEE PIC 9(3)V99 VALUE 0.
       01   LBFEE PIC 9(3)V99 VALUE 0.
       01   MCFEE PIC 9(4)V99 VALUE 0.
       01   TAFEE PIC 9(5)V99 VALUE 0.
       01   HEAD-1.
            02 FILLER PIC X(20) VALUE SPACES.
            02 FILLER PIC X(40)
            VALUE "POLYTECHNIC UNVERSITY OF THE PHILIPPINES".
            02 FILLER PIC X(20) VALUE SPACES.
       01   HEAD-2.
            02 FILLER PIC X(31) VALUE SPACES.
            02 FILLER PIC X(17) VALUE "STA. MESA, MANILA".
            02 FILLER PIC X(32) VALUE SPACES.
       01   HEAD-3.
            02 FILLER PIC X(25) VALUE SPACES.
            02 FILLER PIC X(30) 
            VALUE "STUDENT'S STATEMENT OF ACCOUNT".
            02 FILLER PIC X(25) VALUE SPACES.
       01   SUB.
            02 FILLER PIC X(1) VALUE SPACES.
            02 FILLER PIC X(10) VALUE "STUDENT NO".
            02 FILLER PIC X(1) VALUE SPACES.
            02 FILLER PIC X(12) VALUE "STUDENT NAME".
            02 FILLER PIC X(14) VALUE SPACES.
            02 FILLER PIC X(17) VALUE "STUDENT TYPE NAME".
            02 FILLER PIC X(1) VALUE SPACES.
            02 FILLER PIC X(4) VALUE "YEAR".
            02 FILLER PIC X(1) VALUE SPACES.
            02 FILLER PIC X(17) VALUE "TOTAL AMT OF FEES".
            02 FILLER PIC X(2) VALUE SPACES.
       01   DETAILS.
            02 FILLER PIC X(1) VALUE SPACES.
            02 P-SNO PIC 9(10).
            02 FILLER PIC X(1) VALUE SPACES.
            02 P-SNA PIC X(25).
            02 FILLER PIC X(1) VALUE SPACES.
            02 P-STYNA PIC X(10).
            02 FILLER PIC X(8) VALUE SPACES.
            02 P-YR PIC 9.
            02 FILLER PIC X(4) VALUE SPACES.
            02 P-TAFEE PIC ZZ,ZZ9.99.
            02 FILLER PIC X(12) VALUE SPACES.
       SCREEN SECTION.
       01   SCRE.
            02 BLANK SCREEN.
       PROCEDURE DIVISION.
       MAIN-RTN.
            OPEN OUTPUT OUTFILE.
            PERFORM HEADING-RTN.
            PERFORM ACCEPT-RTN THRU ACCEPT-RTN UNTIL EOFSW = 1.
            PERFORM FINISH-RTN.
            STOP RUN.
       HEADING-RTN.
            WRITE OUTREC FROM HEAD-1 AFTER PAGE.
            WRITE OUTREC FROM HEAD-2 AFTER 1.
            WRITE OUTREC FROM HEAD-3 AFTER 2.
            WRITE OUTREC FROM SUB AFTER 2.
       ACCEPT-RTN.
            DISPLAY SCRE.
            MOVE 0 TO CRC.
            MOVE 0 TO YR.
            MOVE SPACES TO STY.
            MOVE SPACES TO ENO.
            MOVE 0 TO TAFEE.

            DISPLAY "POLYTECHNIC UNIVERSIRTY OF THE PHILIPPINES"
            LINE 1 COLUMN 1.
            DISPLAY "STA. MESA, MANILA"
            LINE 2 COLUMN 1.
            DISPLAY "STUDENT'S STATEMENT OF ACCOUNT"
            LINE 4 COLUMN 1.

            DISPLAY "STUDENT NO:" LINE 5 COLUMN 1.
            ACCEPT SNO LINE 5 COLUMN 35.

            DISPLAY "STUDENT NAME:" LINE 6 COLUMN 1.
            ACCEPT SNA LINE 6 COLUMN 35.

            PERFORM COURSE-RTN UNTIL CRC > 0 AND CRC < 7.

            DISPLAY "COURSE NAME:" LINE 8 COLUMN 1.
            DISPLAY CNA LINE 8 COLUMN 35.

            IF CRC = 6 PERFORM YEAR-RTN UNTIL YR > 0 AND YR < 6
            ELSE PERFORM YEAR-RTN UNTIL YR > 0 AND YR < 5.

            DISPLAY "SECTION:" LINE 10 COLUMN 1.
            ACCEPT SC LINE 10 COLUMN 35.

            PERFORM STUDENT-RTN UNTIL STY = 'R' OR STY = 'I'
            OR STY = 'r' OR STY = 'i'.

            DISPLAY "STUDENT TYPE NAME:" LINE 12 COLUMN 1.
            DISPLAY STYNA LINE 12 COLUMN 35.

            DISPLAY "TUITION FEE:" LINE 13 COLUMN 1.
            ACCEPT TTFEE LINE 13 COLUMN 35.
            DISPLAY "STUDENT COUNCIL FEE:" LINE 14 COLUMN 1.
            ACCEPT SCFEE LINE 14 COLUMN 35.
            DISPLAY "LABORATORY FEE:" LINE 15 COLUMN 1.
            ACCEPT LBFEE LINE 15 COLUMN 35.
            DISPLAY "MISCELLANEOUS FEE:" LINE 16 COLUMN 1.
            ACCEPT MCFEE LINE 16 COLUMN 35.

            ADD TTFEE, SCFEE, LBFEE, MCFEE TO TAFEE.
            DISPLAY "TOTAL AMOUNT OF FEES:" LINE 17 COLUMN 1.
            DISPLAY TAFEE LINE 17 COLUMN 35.
            
            MOVE SNO TO P-SNO.
            MOVE SNA TO P-SNA.
            MOVE STYNA TO P-STYNA.
            MOVE YR TO P-YR.
            MOVE TAFEE TO P-TAFEE.
            WRITE OUTREC FROM DETAILS AFTER 1.

            PERFORM ANOTHER-RTN UNTIL ENO = 'y' OR ENO = 'Y'
            OR ENO = 'n' OR ENO = 'N'.
       ACCEPT-RTN-END.
       COURSE-RTN.
            DISPLAY "COURSE CODE:" LINE 7 COLUMN 1.
            ACCEPT CRC LINE 7 COLUMN 35.
            IF CRC = 1 MOVE "ACCOUNTING" TO CNA.
            IF CRC = 2 MOVE "ARTS" TO CNA.
            IF CRC = 3 MOVE "BUSINESS" TO CNA.
            IF CRC = 4 MOVE "COMPUTER SCIENCE/INFO.TECH" TO CNA.
            IF CRC = 5 MOVE "EDUCATION" TO CNA.
            IF CRC = 6 MOVE "ENGINEERING" TO CNA.
       YEAR-RTN.
            DISPLAY "YEAR:" LINE 9 COLUMN 1.
            ACCEPT YR LINE 9 COLUMN 35.
       STUDENT-RTN.
            DISPLAY "STUDENT TYPE:" LINE 11 COLUMN 1.
            ACCEPT STY LINE 11 COLUMN 35.
            IF STY = 'R' OR STY = 'r' MOVE "REGULAR" TO STYNA.
            IF STY = 'I' OR STY = 'i' MOVE "IRREGULAR" TO STYNA.
       ANOTHER-RTN.
            DISPLAY "INPUT ANOTHER RECORD (Y/N)?"
            LINE 19 COLUMN 1.
            ACCEPT ENO LINE 19 COLUMN 40.
            IF ENO = 'N' OR ENO = 'n' MOVE 1 TO EOFSW.
       FINISH-RTN.
            CLOSE OUTFILE.
            DISPLAY "PROGRAM EXECUTED" LINE 21 COLUMN 1.