       IDENTIFICATION DIVISION.
       PROGRAM-ID. friends.
      *AUTHOR. JEI.
      *INSTALLATION. TAYTAY.
      *DATE-WRITTEN. 01-26-2024.
      *DATE-COMPILED. 01-26-2024.
      *SECURITY. US ONLY.
      *REMARKS first cobol.

       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SOURCE-COMPUTER. GIGABYTE.
       OBJECT-COMPUTER. GIGABYTE.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT JEI ASSIGN TO "resultss".
           SELECT OUTFILE ASSIGN TO "POPULATION".
       DATA DIVISION.
       FILE SECTION.
       FD  JEI
           LABEL RECORD IS STANDARD
           DATA RECORD IS INREC.
       01  INREC.
           02 LBC PIC 9(2).
           02 LLN PIC X(20).
           02 TNCO PIC 9(2).
           02 TNRF PIC 9(3).
           02 TNPTF PIC 9(3).
           02 TNES PIC 9(6).
           02 TNRS PIC 9(4).
           02 TNIS PIC 9(3).
       FD  OUTFILE
           LABEL RECORD IS OMITTED
           DATA RECORD IS OUTREC.
       01  OUTREC.
           02 FILLER PIC X(80).
       WORKING-STORAGE SECTION.
       01  EOFSW PIC 9 VALUE 0.
       01  BC PIC 9(2) VALUE 0.
       01  LN PIC X(20) VALUE SPACES.
       01  NCO PIC 9(2) VALUE 0.
       01  NRF PIC 9(3) VALUE 0.
       01  NPTF PIC 9(3) VALUE 0.
       01  NES PIC 9(6) VALUE 0.
       01  NRS PIC 9(4) VALUE 0.
       01  NIS PIC 9(3) VALUE 0.
       01  ENO PIC X VALUE 'Y'.
       SCREEN SECTION.
       01  SCRE.
               02  BLANK SCREEN.
       PROCEDURE DIVISION.
       MAIN-RTN.
           OPEN OUTPUT JEI.
           PERFORM AKSEPT-RTN THRU  AKSEPT-RTN-END UNTIL EOFSW = 1.
           CLOSE JEI.  
           STOP RUN.
       AKSEPT-RTN.
           DISPLAY SCRE.
           PERFORM BRANCH-CODE-RTN UNTIL BC > 0 AND BC < 7.
           MOVE BC TO LBC.
           DISPLAY 'LOCATION NAME:' LINE 7 COLUMN 10.
           ACCEPT LN LINE 7 COLUMN 40.
           MOVE LLN TO LN.
           DISPLAY 'TOTAL.NO OF COURSES OFFERED:' LINE 8 COLUMN 10.
           ACCEPT NCO LINE 8 COLUMN 40.
           MOVE NCO TO TNCO.
           DISPLAY 'TOTAL.NO OF REGULAR FACULTY:' LINE 9 COLUMN 10.
           ACCEPT NRF LINE 9 COLUMN 40.
           MOVE NRF TO TNRF.
           DISPLAY 'TOTAL.NO OF PART TIME FACULTY:' LINE 10 COLUMN 10.
           ACCEPT NPTF LINE 10 COLUMN 40.
           MOVE NPTF TO TNPTF.
           DISPLAY 'TOTAL.NO OF ENROLLED STUDENTS:' LINE 11 COLUMN 10.
           ACCEPT NES LINE 11 COLUMN 40.
           MOVE NES TO TNES.
           DISPLAY 'TOTAL.NO OF REGULAR STUDENTS:' LINE 12 COLUMN 10.
           ACCEPT NRS LINE 12 COLUMN 40.
           MOVE NRS TO TNRS.
           DISPLAY 'TOTAL.NO OF IRREGULAR STUDENTS:' LINE 13 COLUMN 10.
           ACCEPT NIS LINE 13 COLUMN 40.
           MOVE NIS TO TNIS.
           DISPLAY 'INPUT ANOTHER RECORD(Y/N)?:' LINE 14 COLUMN 10.
           ACCEPT ENO LINE 14 COLUMN 40
           IF ENO = 'N' MOVE 1 TO EOFSW.
       AKSEPT-RTN-END.
       BRANCH-CODE-RTN.
           DISPLAY 'LOCATION BRANCH CODE:' LINE 6 COLUMN 10.
           ACCEPT BC LINE 6 COLUMN 40.
           IF BC = '1' DISPLAY 'PUP MAIN'
           ACCEPT BC LINE 6 COLUMN 40.
           IF BC = '2' DISPLAY 'PUP COMMONWEALTH'
           ACCEPT BC LINE 6 COLUMN 40.
           IF BC = '3' DISPLAY 'PUP STA. ROSA'
           ACCEPT BC LINE 6 COLUMN 40.
           IF BC = '4' DISPLAY 'PUP TAGUIG'
           ACCEPT BC LINE 6 COLUMN 40.
           IF BC = '5' DISPLAY 'PUP BULACAN'
           ACCEPT BC LINE 6 COLUMN 40.
           IF BC = '6' DISPLAY 'PUP SAN JUAN'
           ACCEPT BC LINE 6 COLUMN 40.




