       IDENTIFICATION DIVISION.
       PROGRAM-ID. POPULATION-REPORT.
      *AUTHOR. jei
      *INSTALLATION. PUP-MANILA.
      *DATE-WRITTEN. 02/09/2024.
      *DATE-COMPILED. 02/09/2024.
      *SECURITY. BSIT22N ONLY.
      *REMARKS. PRACTICE SET. 
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SOURCE-COMPUTER. LAPTOP-GUPS4DA8.
       OBJECT-COMPUTER. LAPTOP-GUPS4DA8.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
            SELECT DSP ASSIGN TO "FURAGGAN".
       DATA DIVISION.
       FILE SECTION.
       FD   DSP
            LABEL RECORD IS STANDARD
            DATA RECORD IS OUTREC.
       01   OUTREC.
            05 D-LNA PIC X(20).
            05 D-TCO PIC 9(2).
            05 D-TES PIC 9(6).
            05 D-TNF PIC 9(6).
            
       WORKING-STORAGE SECTION.
       01   EOFSW PIC 9 VALUE 0.
       01   ENO PIC X VALUE SPACES.
       01   LBC PIC 9(2) VALUE 0.
       01   LNA PIC X(20) VALUE SPACES.
       01   TCO PIC 9(2) VALUE 0.
       01   TRF PIC 9(3) VALUE 0.
       01   TPF PIC 9(3) VALUE 0.
       01   TNF PIC 9(6) VALUE 0.
       01   TES PIC 9(6) VALUE 0.
       01   TRS PIC 9(4) VALUE 0.
       01   TIS PIC 9(3) VALUE 0.
       01   SVTES PIC 9(6) VALUE 999999.
       01   SVTNF PIC 9(6) VALUE 999999.
       01   LES PIC ZZZZZ9.
       01   LNF PIC ZZZZZ9.
       01   LESBNA PIC X(20) VALUE SPACES.
       01   LNFBNA PIC X(20) VALUE SPACES.
       SCREEN SECTION.
       01   SCRE.
            02 BLANK SCREEN.
       PROCEDURE DIVISION.
       MAIN-RTN.
            OPEN OUTPUT DSP.
            PERFORM ACCEPT-RTN THRU ACCEPT-RTN-END UNTIL EOFSW = 1.
            PERFORM FINISH-RTN.
            CLOSE DSP.
            STOP RUN.
       ACCEPT-RTN.
            DISPLAY SCRE.
            MOVE SPACES TO ENO.
            MOVE 0 TO LBC.
            DISPLAY "POLYTECHNIC UNIVERSITY OF THE PHILIPPINES"
            LINE 1 COLUMN 19.
            DISPLAY "STA. MESA, MANILA" LINE 2 COLUMN 31.
            DISPLAY "POPULATION REPORT" LINE 5 COLUMN 31.
            DISPLAY "FIRST SEMESTER" LINE 6 COLUMN 32.
            DISPLAY "2023-2024" LINE 7 COLUMN 35.
            PERFORM BRANCH-RTN UNTIL LBC > 0 AND LBC < 7.
            MOVE LNA TO D-LNA.
            DISPLAY "LOCATION NAME:" LINE 10 COLUMN 3.
            DISPLAY LNA LINE 10 COLUMN 40.
            DISPLAY "TOTAL NO. OF COURSES OFFERED:"
            LINE 11 COLUMN 3.
            ACCEPT TCO LINE 11 COLUMN 40.
            MOVE TCO TO D-TCO.
            DISPLAY "TOTAL NO. OF REGULAR FACULTY:"
            LINE 12 COLUMN 3.
            ACCEPT TRF LINE 12 COLUMN 40.
            DISPLAY "TOTAL NO. OF PART TIME FACULTY:"
            LINE 13 COLUMN 3.
            ACCEPT TPF LINE 13 COLUMN 40.
            PERFORM FACULTY-RTN.
            MOVE TNF TO D-TNF.
            IF TNF < SVTNF 
            MOVE TNF TO SVTNF 
            MOVE TNF TO LNF 
            MOVE LNA TO LNFBNA.
            DISPLAY "TOTAL NO. OF ENROLLED STUDENTS:"
            LINE 14 COLUMN 3.
            ACCEPT TES LINE 14 COLUMN 40.
            MOVE TES TO D-TES.
            IF TES < SVTES 
            MOVE TES TO SVTES 
            MOVE TES TO LES 
            MOVE LNA TO LESBNA.
            DISPLAY "TOTAL NO. OF REGULAR STUDENTS:"
            LINE 15 COLUMN 3.
            ACCEPT TRS LINE 15 COLUMN 40.
            DISPLAY "TOTAL NO. OF IRREGULAR STUDENTS:"
            LINE 16 COLUMN 3.
            COMPUTE TIS = TES - TRS.
            DISPLAY TIS LINE 16 COLUMN 40.
            WRITE OUTREC.
            PERFORM ANOTHER-RTN
            UNTIL ENO = 'Y' OR  ENO = 'y' 
            OR  ENO = 'N' OR  ENO = 'n'.
       ACCEPT-RTN-END.
       BRANCH-RTN.
            DISPLAY "LOCATION BRANCH CODE:" LINE 9 COLUMN 3.
            ACCEPT LBC LINE 9 COLUMN 40.
            IF LBC = 1 MOVE "PUP MAIN" TO LNA.
            IF LBC = 2 MOVE "PUP COMMONWEALTH" TO LNA.
            IF LBC = 3 MOVE "PUP STA. ROSA" TO LNA.
            IF LBC = 4 MOVE "PUP TAGUIG" TO LNA.
            IF LBC = 5 MOVE "PUP BULACAN" TO LNA.
            IF LBC = 6 MOVE "PUP SAN JUAN" TO LNA.
       FACULTY-RTN.
            COMPUTE TNF = TRF + TPF.
       ANOTHER-RTN.
            DISPLAY "INPUT ANOTHER RECORD (Y/N)?"
            LINE 18 COLUMN 25.
            ACCEPT ENO LINE 18 COLUMN 54.
            IF ENO = 'N' OR 'n' MOVE 1 TO EOFSW.
            IF ENO = 'Y' OR 'y' MOVE 0 TO EOFSW.
       FINISH-RTN.
            DISPLAY "LEAST NO. OF ENROLLED STUDENTS:" LINE 20 COLUMN 3.
            DISPLAY LES LINE 20 COLUMN 40.
            DISPLAY "BRANCH NAME:" LINE 21 COLUMN 3.
            DISPLAY LESBNA LINE 21 COLUMN 40.
            DISPLAY "LEAST NO. OF FACULTY:" LINE 23 COLUMN 3.
            DISPLAY LNF LINE 23 COLUMN 40.
            DISPLAY "BRANCH NAME:" LINE 24 COLUMN 3.
            DISPLAY LNFBNA LINE 24 COLUMN 40.